; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	instrument2 - instrument
	satellite2 - satellite
	instrument3 - instrument
	instrument4 - instrument
	instrument5 - instrument
	satellite3 - satellite
	instrument6 - instrument
	image3 - mode
	infrared0 - mode
	image5 - mode
	infrared6 - mode
	spectrograph1 - mode
	thermograph4 - mode
	thermograph2 - mode
	Star0 - direction
	GroundStation7 - direction
	GroundStation4 - direction
	GroundStation3 - direction
	Star5 - direction
	GroundStation2 - direction
	Star6 - direction
	GroundStation1 - direction
	GroundStation8 - direction
	Planet9 - direction
	Phenomenon10 - direction
	Planet11 - direction
	Planet12 - direction
	Star13 - direction
)
(:init
	(supports instrument0 thermograph4)
	(supports instrument0 spectrograph1)
	(supports instrument0 infrared6)
	(supports instrument0 image5)
	(supports instrument0 infrared0)
	(calibration_target instrument0 GroundStation8)
	(calibration_target instrument0 Star5)
	(calibration_target instrument0 GroundStation7)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 GroundStation2)
	(supports instrument1 thermograph2)
	(supports instrument1 infrared6)
	(supports instrument1 spectrograph1)
	(calibration_target instrument1 Star5)
	(supports instrument2 spectrograph1)
	(supports instrument2 thermograph2)
	(calibration_target instrument2 GroundStation4)
	(calibration_target instrument2 GroundStation1)
	(calibration_target instrument2 Star5)
	(on_board instrument1 satellite1)
	(on_board instrument2 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Planet12)
	(supports instrument3 thermograph4)
	(supports instrument3 thermograph2)
	(calibration_target instrument3 Star5)
	(calibration_target instrument3 GroundStation1)
	(calibration_target instrument3 GroundStation3)
	(supports instrument4 image3)
	(calibration_target instrument4 GroundStation2)
	(calibration_target instrument4 GroundStation1)
	(calibration_target instrument4 GroundStation8)
	(supports instrument5 thermograph2)
	(calibration_target instrument5 GroundStation1)
	(on_board instrument3 satellite2)
	(on_board instrument4 satellite2)
	(on_board instrument5 satellite2)
	(power_avail satellite2)
	(pointing satellite2 GroundStation8)
	(supports instrument6 thermograph2)
	(supports instrument6 image3)
	(supports instrument6 infrared6)
	(calibration_target instrument6 GroundStation8)
	(calibration_target instrument6 GroundStation1)
	(calibration_target instrument6 Star6)
	(on_board instrument6 satellite3)
	(power_avail satellite3)
	(pointing satellite3 GroundStation4)
)
(:goal (and
	(pointing satellite1 Planet9)
	(pointing satellite3 Star6)
	(have_image Planet9 image3)
	(have_image Planet9 image5)
	(have_image Phenomenon10 image3)
	(have_image Phenomenon10 spectrograph1)
	(have_image Planet11 thermograph4)
	(have_image Planet12 infrared6)
	(have_image Star13 infrared0)
))

)

; plan
1. (turn_to satellite3 star6 groundstation4)
   deleted: (pointing satellite3 groundstation4)
   added: (pointing satellite3 star6)
   goals met: 1 of 9
2. (switch_on instrument4 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument4)
   goals met: 1 of 9
3. (calibrate satellite2 instrument4 groundstation8)
   added: (calibrated instrument4)
   goals met: 1 of 9
4. (turn_to satellite2 planet9 groundstation8)
   deleted: (pointing satellite2 groundstation8)
   added: (pointing satellite2 planet9)
   goals met: 1 of 9
5. (take_image satellite2 planet9 instrument4 image3)
   added: (have_image planet9 image3)
   goals met: 2 of 9
6. (turn_to satellite2 phenomenon10 planet9)
   deleted: (pointing satellite2 planet9)
   added: (pointing satellite2 phenomenon10)
   goals met: 2 of 9
7. (turn_to satellite1 planet9 planet12)
   deleted: (pointing satellite1 planet12)
   added: (pointing satellite1 planet9)
   goals met: 3 of 9
8. (turn_to satellite0 groundstation7 groundstation2)
   deleted: (pointing satellite0 groundstation2)
   added: (pointing satellite0 groundstation7)
   goals met: 3 of 9
9. (take_image satellite2 phenomenon10 instrument4 image3)
   added: (have_image phenomenon10 image3)
   goals met: 4 of 9
10. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 4 of 9
11. (calibrate satellite0 instrument0 groundstation7)
   added: (calibrated instrument0)
   goals met: 4 of 9
12. (turn_to satellite0 phenomenon10 groundstation7)
   deleted: (pointing satellite0 groundstation7)
   added: (pointing satellite0 phenomenon10)
   goals met: 4 of 9
13. (take_image satellite0 phenomenon10 instrument0 spectrograph1)
   added: (have_image phenomenon10 spectrograph1)
   goals met: 5 of 9
14. (turn_to satellite0 planet11 phenomenon10)
   deleted: (pointing satellite0 phenomenon10)
   added: (pointing satellite0 planet11)
   goals met: 5 of 9
15. (take_image satellite0 planet11 instrument0 thermograph4)
   added: (have_image planet11 thermograph4)
   goals met: 6 of 9
16. (turn_to satellite0 planet12 planet11)
   deleted: (pointing satellite0 planet11)
   added: (pointing satellite0 planet12)
   goals met: 6 of 9
17. (take_image satellite0 planet12 instrument0 infrared6)
   added: (have_image planet12 infrared6)
   goals met: 7 of 9
18. (turn_to satellite0 planet9 planet12)
   deleted: (pointing satellite0 planet12)
   added: (pointing satellite0 planet9)
   goals met: 7 of 9
19. (take_image satellite0 planet9 instrument0 image5)
   added: (have_image planet9 image5)
   goals met: 8 of 9
20. (turn_to satellite0 star13 planet9)
   deleted: (pointing satellite0 planet9)
   added: (pointing satellite0 star13)
   goals met: 8 of 9
21. (take_image satellite0 star13 instrument0 infrared0)
   added: (have_image star13 infrared0)
   goals met: 9 of 9
